package javaTeamProject;

public class Array {

	//디폴트 생성자
	public Array() {
	      
	   }
	//해당 배열들은 디폴트 접근자로 설정하여 javaTeamProject 패키지 안에서만 접근가능하도록 구현
	
	// 메뉴 1차원 배열 선언
		String[] menu = {
	         "신라면","진라면","스낵면","불닭볶음면",
	         "우유","콜라","사이다","쥬스",
	         "삼각김밥_전주","삼각김밥_불닭","삼각김밥_참치","삼각김밥_스팸",
	         "수미칩","고소미","스윙칩","프링글스","포카칩","마이구미"};
	   // 가격 1차원 배열 생성
		int[] price = {
	         800,700,800,1000,
	         3000,3000,3000,4000,
	         900,900,900,1000,
	         2000,2000,2500,3000,2000,800};
	   //품류 1차원 배열 생성
		String[] item = {"라면","라면","라면","라면",
			   "음료수","음료수","음료수","음료수",
			   "삼각김밥","삼각김밥","삼각김밥","삼각김밥"
			   ,"과자","과자","과자","과자","과자","과자"};
	   // 개수 1로 초기화.
		int[] count = {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1};
	   
	 //서브버튼 배열 선언
		String[] Str = {"재난지원금","선택 삭제","리셋","결제"};
	   // table에 표시될 3가지 품목
		String [] ColName = {"품목","제품","수량","가격"};
	   // table에 사용될 2차원 배열 선언
		String [][] Data ;
	
}
